In [46]:
pip install xlrd>=2.0.1

Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [47]:
import pandas as pd

In [48]:
df = pd.read_csv(r"C:\Git_test\Project 2 Docs\Data Sets\Consumer Confidence Index.csv", header=0,
)

In [49]:
print(df.head())
print(df.shape)

  STRUCTURE                        STRUCTURE_ID                STRUCTURE_NAME  \
0  DATAFLOW  OECD.SDD.STES:DSD_STES@DF_CLI(4.1)  Composite leading indicators
1  DATAFLOW  OECD.SDD.STES:DSD_STES@DF_CLI(4.1)  Composite leading indicators
2  DATAFLOW  OECD.SDD.STES:DSD_STES@DF_CLI(4.1)  Composite leading indicators
3  DATAFLOW  OECD.SDD.STES:DSD_STES@DF_CLI(4.1)  Composite leading indicators
4  DATAFLOW  OECD.SDD.STES:DSD_STES@DF_CLI(4.1)  Composite leading indicators

  ACTION REF_AREA Reference area FREQ Frequency of observation MEASURE  \
0      I    NAFTA          NAFTA    M                  Monthly      LI
1      I    NAFTA          NAFTA    M                  Monthly      LI
2      I      AUS      Australia    M                  Monthly      LI
3      I      AUS      Australia    M                  Monthly      LI
4      I      AUS      Australia    M                  Monthly      LI

                             Measure  ...  OBS_VALUE Observation value  \
0  Composite leading indicator (CLI)  ...  100.52800               NaN
1  Composite leading indicator (CLI)  ...  100.52760               NaN
2  Composite leading indicator (CLI)  ...  100.30720               NaN
3  Composite leading indicator (CLI)  ...  100.70580               NaN
4  Composite leading indicator (CLI)  ...   99.10394               NaN

  OBS_STATUS Observation status UNIT_MULT Unit multiplier DECIMALS Decimals  \
0          A       Normal value         0           Units        2      Two
1          A       Normal value         0           Units        2      Two
2          A       Normal value         0           Units        2      Two
3          A       Normal value         0           Units        2      Two
4          A       Normal value         0           Units        2      Two

  BASE_PER Base period
0      NaN         NaN
1      NaN         NaN
2      NaN         NaN
3      NaN         NaN
4      NaN         NaN

[5 rows x 34 columns]
(13967, 34)

In [50]:
print(df.columns.tolist)

<bound method IndexOpsMixin.tolist of Index(['STRUCTURE', 'STRUCTURE_ID', 'STRUCTURE_NAME', 'ACTION', 'REF_AREA',
       'Reference area', 'FREQ', 'Frequency of observation', 'MEASURE',
       'Measure', 'UNIT_MEASURE', 'Unit of measure', 'ACTIVITY',
       'Economic activity', 'ADJUSTMENT', 'Adjustment', 'TRANSFORMATION',
       'Transformation', 'TIME_HORIZ', 'Time horizon', 'METHODOLOGY',
       'Calculation methodology', 'TIME_PERIOD', 'Time period', 'OBS_VALUE',
       'Observation value', 'OBS_STATUS', 'Observation status', 'UNIT_MULT',
       'Unit multiplier', 'DECIMALS', 'Decimals', 'BASE_PER', 'Base period'],
      dtype='object')>

In [51]:
df = df[['Reference area', 'TIME_PERIOD', 'OBS_VALUE']]
df

      Reference area TIME_PERIOD  OBS_VALUE
0              NAFTA     2004-12  100.52800
1              NAFTA     2004-11  100.52760
2          Australia     1981-09  100.30720
3          Australia     1981-08  100.70580
4          Australia     1977-07   99.10394
...              ...         ...        ...
13962          NAFTA     2005-05  100.24020
13963          NAFTA     2005-04  100.27510
13964          NAFTA     2005-03  100.35330
13965          NAFTA     2005-02  100.44250
13966          NAFTA     2005-01  100.50380

[13967 rows x 3 columns]

In [52]:
df.iloc[0:].applymap(type)

C:\Users\David\AppData\Local\Temp\ipykernel_3584\3970406019.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.iloc[0:].applymap(type)

      Reference area    TIME_PERIOD        OBS_VALUE
0      <class 'str'>  <class 'str'>  <class 'float'>
1      <class 'str'>  <class 'str'>  <class 'float'>
2      <class 'str'>  <class 'str'>  <class 'float'>
3      <class 'str'>  <class 'str'>  <class 'float'>
4      <class 'str'>  <class 'str'>  <class 'float'>
...              ...            ...              ...
13962  <class 'str'>  <class 'str'>  <class 'float'>
13963  <class 'str'>  <class 'str'>  <class 'float'>
13964  <class 'str'>  <class 'str'>  <class 'float'>
13965  <class 'str'>  <class 'str'>  <class 'float'>
13966  <class 'str'>  <class 'str'>  <class 'float'>

[13967 rows x 3 columns]

In [53]:
df = df.rename(columns={'OBS_VALUE': 'CCI Value'})
df

      Reference area TIME_PERIOD  CCI Value
0              NAFTA     2004-12  100.52800
1              NAFTA     2004-11  100.52760
2          Australia     1981-09  100.30720
3          Australia     1981-08  100.70580
4          Australia     1977-07   99.10394
...              ...         ...        ...
13962          NAFTA     2005-05  100.24020
13963          NAFTA     2005-04  100.27510
13964          NAFTA     2005-03  100.35330
13965          NAFTA     2005-02  100.44250
13966          NAFTA     2005-01  100.50380

[13967 rows x 3 columns]

In [54]:
df = df.sort_values('TIME_PERIOD')
df['TIME_PERIOD']

7422     1955-01
13101    1955-02
7421     1955-02
7647     1955-03
13100    1955-03
          ...
11984    2025-09
8445     2025-09
9278     2025-09
12956    2025-09
2215     2025-09
Name: TIME_PERIOD, Length: 13967, dtype: object

In [55]:
df = df[df['Reference area'] == 'United Kingdom']
df['Reference area']

6600    United Kingdom
6599    United Kingdom
6598    United Kingdom
6597    United Kingdom
6596    United Kingdom
             ...
7309    United Kingdom
7308    United Kingdom
7307    United Kingdom
7306    United Kingdom
7305    United Kingdom
Name: Reference area, Length: 814, dtype: object

In [56]:
df[df['TIME_PERIOD'].isin(['2015-01','2025-03'])]

      Reference area TIME_PERIOD  CCI Value
7169  United Kingdom     2015-01   101.3254
7311  United Kingdom     2025-03   100.7234

In [57]:
pd.set_option('display.max_rows', 60)
print(df['TIME_PERIOD'])

6600    1957-12
6599    1958-01
6598    1958-02
6597    1958-03
6596    1958-04
         ...
7309    2025-05
7308    2025-06
7307    2025-07
7306    2025-08
7305    2025-09
Name: TIME_PERIOD, Length: 814, dtype: object

In [58]:
print(df[df['TIME_PERIOD'].between('2015-01', '2021-01')])

      Reference area TIME_PERIOD  CCI Value
7169  United Kingdom     2015-01  101.32540
7168  United Kingdom     2015-02  101.31250
7167  United Kingdom     2015-03  101.31780
7166  United Kingdom     2015-04  101.31110
7165  United Kingdom     2015-05  101.27500
...              ...         ...        ...
6851  United Kingdom     2020-09   98.37845
6850  United Kingdom     2020-10   97.94607
6849  United Kingdom     2020-11   97.94336
6848  United Kingdom     2020-12   98.98046
6847  United Kingdom     2021-01   98.61920

[73 rows x 3 columns]

In [59]:
df = df.loc[7169:7311]
print(df['TIME_PERIOD'])

7169    2015-01
7168    2015-02
7167    2015-03
7166    2015-04
7165    2015-05
         ...
7315    2024-11
7314    2024-12
7313    2025-01
7312    2025-02
7311    2025-03
Name: TIME_PERIOD, Length: 123, dtype: object

In [60]:
df['CCI Value'] = df['CCI Value'].astype(int)
df['CCI Value']

7169    101
7168    101
7167    101
7166    101
7165    101
       ...
7315    100
7314    100
7313    100
7312    100
7311    100
Name: CCI Value, Length: 123, dtype: int32

In [61]:
print(df.index)
print(len(df))

Index([7169, 7168, 7167, 7166, 7165, 7164, 7163, 7162, 7161, 7160,
       ...
       7320, 7319, 7318, 7317, 7316, 7315, 7314, 7313, 7312, 7311],
      dtype='int64', length=123)
123

In [62]:
print(df['CCI Value'].isna().sum())

0

In [63]:
df = df.reset_index(drop=True)

In [64]:
df['TIME_PERIOD']

0      2015-01
1      2015-02
2      2015-03
3      2015-04
4      2015-05
        ...
118    2024-11
119    2024-12
120    2025-01
121    2025-02
122    2025-03
Name: TIME_PERIOD, Length: 123, dtype: object

In [65]:
df_new = df.groupby(df.index // 3)['CCI Value'].mean().round(1)
df_new = pd.DataFrame({
    'TIME_PERIOD': df.groupby(df.index // 3)['TIME_PERIOD'].first().values,
    'Consumer Confidence': df_new.values
})

print(df_new)

   TIME_PERIOD  Consumer Confidence
0      2015-01                101.0
1      2015-04                101.0
2      2015-07                100.3
3      2015-10                100.0
4      2016-01                 99.7
5      2016-04                 99.0
6      2016-07                 99.7
7      2016-10                100.0
8      2017-01                101.0
9      2017-04                101.0
10     2017-07                100.7
11     2017-10                100.0
12     2018-01                100.0
13     2018-04                 99.7
14     2018-07                 98.7
15     2018-10                 98.0
16     2019-01                 97.0
17     2019-04                 97.0
18     2019-07                 97.0
19     2019-10                 97.3
20     2020-01                 97.3
21     2020-04                 90.0
22     2020-07                 98.7
23     2020-10                 97.3
24     2021-01                 99.0
25     2021-04                101.0
26     2021-07                101.7
27     2021-10                100.7
28     2022-01                 99.0
29     2022-04                 96.3
30     2022-07                 95.0
31     2022-10                 95.0
32     2023-01                 96.3
33     2023-04                 97.7
34     2023-07                 98.3
35     2023-10                 99.0
36     2024-01                 99.7
37     2024-04                100.0
38     2024-07                100.0
39     2024-10                100.0
40     2025-01                100.0

In [66]:
print(df_new.shape)

(41, 2)

In [67]:
df_new.to_excel("C:\\Git_test\\Project 2 Docs\\Data Sets\\CCI_transformed.xlsx", index=False)